In [2]:
# Import all libraries needed 

import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import sys 

# Enable inline plotting
%matplotlib inline

In [3]:
# Loading data from csv file

Location = "algebradata.csv"
df = pd.read_csv(Location)

In [4]:
# Display first five lines of data

df.head()

     Fname     Lname Gender Grade  Hours of Study
0     Mary  Ettienne      F     B              16
1  Charles    Looner      M     F               8
2    Betty  Franklin      F     A              24
3    Roger   Withers      M     C               5
4     John   Mulgrew      M     A               5

In [5]:
# Checking for missing data

missing_data_counts = pd.DataFrame(df.isnull().sum(), columns=['Missing Values'])
missing_data_counts

                Missing Values
Fname                        0
Lname                        0
Gender                       0
Grade                        0
Hours of Study               0

In [6]:
# Function to convert gender to numeric value

def score_to_numeric(x):
    if x=='F':
        return 1
    if x=='M':
        return 0

In [7]:
#Applying function to dataset

df['Gender_value'] = df['Gender'].apply(score_to_numeric)
df.tail()

        Fname      Lname Gender Grade  Hours of Study  Gender_value
994    Harold     Looner      M     D              11             0
995     Paula      Moore      F     C               6             1
996    Martin   Franklin      M     C              25             0
997    Nicole  Henderson      F     A              20             1
998  Veronica   Harrison      F     D              21             1

In [8]:
# Function to convert grade letters to numeric value

def score_to_numeric(x):
    if x=='A':
        return 100
    if x=='B':
        return 80
    if x=='C':
        return 60
    if x=='D':
        return 10
    if x=='F':
        return 0

In [9]:
# Applying function to dataset

df['Grade_value'] = df['Grade'].apply(score_to_numeric)
df.head()

     Fname     Lname Gender Grade  Hours of Study  Gender_value  Grade_value
0     Mary  Ettienne      F     B              16             1           80
1  Charles    Looner      M     F               8             0            0
2    Betty  Franklin      F     A              24             1          100
3    Roger   Withers      M     C               5             0           60
4     John   Mulgrew      M     A               5             0          100

In [10]:
# Average for all columns that are computable

df.mean()

Hours of Study    15.115115
Gender_value       0.518519
Grade_value       59.569570
dtype: float64

In [11]:
# Average hours of study by grade for all students

df.groupby('Grade')['Hours of Study'].mean()

Grade
A    17.935811
B    15.893939
C    14.243655
D    14.577778
F     6.722892
Name: Hours of Study, dtype: float64

In [12]:
# Computing the number of students with a passing grade

df.loc[df['Grade_value'] > 10].count()

Fname             691
Lname             691
Gender            691
Grade             691
Hours of Study    691
Gender_value      691
Grade_value       691
dtype: int64

In [13]:
# Creating new dataframe of all students with grade greater than 10

df2 = df.loc[df['Grade_value'] >10]
df2.head()

   Fname     Lname Gender Grade  Hours of Study  Gender_value  Grade_value
0   Mary  Ettienne      F     B              16             1           80
2  Betty  Franklin      F     A              24             1          100
3  Roger   Withers      M     C               5             0           60
4   John   Mulgrew      M     A               5             0          100
5   Jada  Isaacson      F     C              30             1           60

In [14]:
df2.count()

Fname             691
Lname             691
Gender            691
Grade             691
Hours of Study    691
Gender_value      691
Grade_value       691
dtype: int64

In [15]:
# Average hours of study for students with a passing grade

df2.mean()

Hours of Study    16.298119
Gender_value       0.551375
Grade_value       82.865412
dtype: float64